# Copyright (c) 2022 Eurotech and/or its affiliates and others
#
# This program and the accompanying materials are made
# available under the terms of the Eclipse Public License 2.0
# which is available at https://www.eclipse.org/legal/epl-2.0/
#
# SPDX-License-Identifier: EPL-2.0
#
# Contributors:
#  Eurotech

name: "ensemble_pipeline"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "ACC_X"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "ACC_Y"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "ACC_Z"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "GYRO_X"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "GYRO_Y"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "GYRO_Z"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "HUMIDITY"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "PRESSURE"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "TEMP_HUM"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "TEMP_PRESS"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
output [
  {
    name: "ANOMALY_SCORE0"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
output [
  {
    name: "ANOMALY0"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocessor"
      model_version: -1
      input_map{
          key: "ACC_X"
          value: "ACC_X"
      }
      input_map{
          key: "ACC_Y"
          value: "ACC_Y"
      }
      input_map{
          key: "ACC_Z"
          value: "ACC_Z"
      }
      input_map{
          key: "GYRO_X"
          value: "GYRO_X"
      }
      input_map{
          key: "GYRO_Y"
          value: "GYRO_Y"
      }
      input_map{
          key: "GYRO_Z"
          value: "GYRO_Z"
      }
      input_map{
          key: "HUMIDITY"
          value: "HUMIDITY"
      }
      input_map{
          key: "PRESSURE"
          value: "PRESSURE"
      }
      input_map{
          key: "TEMP_HUM"
          value: "TEMP_HUM"
      }
      input_map{
          key: "TEMP_PRESS"
          value: "TEMP_PRESS"
      }
      output_map {
        key: "INPUT0"
        value: "preprocess_out"
      }
    },
    {
      model_name: "tf_autoencoder_fp32"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "preprocess_out"
      }
      output_map {
        key: "OUTPUT0"
        value: "autoencoder_output"
      }
    },
    {
      model_name: "postprocessor"
      model_version: -1
      input_map {
        key: "RECONSTR0"
        value: "autoencoder_output"
      }
      input_map {
        key: "ORIG0"
        value: "preprocess_out"
      }
      output_map {
        key: "ANOMALY_SCORE0"
        value: "ANOMALY_SCORE0"
      }
      output_map {
        key: "ANOMALY0"
        value: "ANOMALY0"
      }
    }
  ]
}
